Итоговый_проект_2/src/InformationRegisters/Цены/Цены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Цены</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Итоговый_проект_2/src/InformationRegisters/Скидки/Скидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Скидки</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НоменклатураНоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Итоговый_проект_2/src/CommonModules/ЦеныСервер/Module.bsl
Функция ЦенаНаДату (Номенклатура, Дата) Экспорт
	
	//получить запросом срез последних на указанную дату с отбором по номенклатуре и вернет цену. 
	Запрос = Новый Запрос;
	Запрос.Текст = 
			//	"ВЫБРАТЬ
			//|	ЦеныСрезПоследних.Период КАК Период,
			//|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
			//|	ЦеныСрезПоследних.Цена КАК Цена
			//|ИЗ
			//|	РегистрСведений.Цены.СрезПоследних(КОНЕЦПЕРИОДА(&Период, ДЕНЬ), ) КАК ЦеныСрезПоследних
			//|ГДЕ
			//|	ЦеныСрезПоследних.Номенклатура = &Номенклатура";	 

			//с помощью ВТ  
			
			"   ВЫБРАТЬ
			|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
			|	МАКСИМУМ(ЦеныСрезПоследних.Период) КАК Период
			|ПОМЕСТИТЬ ВТ_номенклатурыБезЦены
			|ИЗ
			|	РегистрСведений.Цены.СрезПоследних (КОНЕЦПЕРИОДА(&Период, ДЕНЬ), ) КАК ЦеныСрезПоследних
			|ГДЕ
			|	ЦеныСрезПоследних.Номенклатура = &Номенклатура
			|
			|СГРУППИРОВАТЬ ПО
			|	ЦеныСрезПоследних.Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МАКСИМУМ(ЦеныСрезПоследних.Цена) КАК Цена,
			|	МАКСИМУМ(ЦеныСрезПоследних.Период) КАК Период,
			|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура
			|ИЗ
			|	ВТ_номенклатурыБезЦены КАК ВТ_номенклатурыБезЦены
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних КАК ЦеныСрезПоследних
			|		ПО ВТ_номенклатурыБезЦены.Номенклатура = ЦеныСрезПоследних.Номенклатура
			|			И ВТ_номенклатурыБезЦены.Период = ЦеныСрезПоследних.Период
			|
			|СГРУППИРОВАТЬ ПО
			|	ЦеныСрезПоследних.Номенклатура";

	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		Цена = Выборка.Цена;
	КонецЦикла;
	
	Возврат Цена;
	
КонецФункции


Функция СкидкаНаДату (Номенклатура, Дата) Экспорт
	
	//получить запросом срез последних на указанную дату с отбором по номенклатуре 
	//и номенклатурной группе и вернет скидку, установленную для номенклатурной группы, 
	//если нет скидки для конкретной номенклатуры.   
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
			"ВЫБРАТЬ
			|	СкидкиСрезПоследних.НоменклатураНоменклатурнаяГруппа.Ссылка КАК НоменклатураНоменклатурнаяГруппа,
			|	СкидкиСрезПоследних.Скидка КАК Скидка,
			|	0 КАК Приоритет
			|ПОМЕСТИТЬ ВременнаяТаблица_Скидки
			|ИЗ
			|	РегистрСведений.Скидки.СрезПоследних(КОНЕЦПЕРИОДА(&Период, ДЕНЬ), НоменклатураНоменклатурнаяГруппа = &Номенклатура) КАК СкидкиСрезПоследних
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	СкидкиСрезПоследних.НоменклатураНоменклатурнаяГруппа.НоменклатурнаяГруппа,
			|	СкидкиСрезПоследних.Скидка,
			|	1
			|ИЗ
			|	РегистрСведений.Скидки.СрезПоследних(КОНЕЦПЕРИОДА(&Период, ДЕНЬ), НоменклатураНоменклатурнаяГруппа = &НоменклатурнаяГруппа) КАК СкидкиСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ВременнаяТаблица_Скидки.НоменклатураНоменклатурнаяГруппа.Ссылка КАК НоменклатураНоменклатурнаяГруппаСсылка,
			|	ВременнаяТаблица_Скидки.Скидка КАК Скидка,
			|	ВременнаяТаблица_Скидки.Приоритет КАК Приоритет
			|ИЗ
			|	ВременнаяТаблица_Скидки КАК ВременнаяТаблица_Скидки
			|
			|УПОРЯДОЧИТЬ ПО
			|	Приоритет ВОЗР";

	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Если ТипЗнч(Номенклатура) <> Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
		Запрос.УстановитьПараметр("НоменклатурнаяГруппа", Номенклатура.НоменклатурнаяГруппа);
	Иначе
		Запрос.УстановитьПараметр("НоменклатурнаяГруппа", Номенклатура);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		Скидка = Выборка.Скидка;
	КонецЦикла;
	
	Возврат Скидка;
	
КонецФункции
